{
    "01001": {
        "complexity": 1,
        "source": [
            "text"
        ],
        "target": [
            "image"
        ],
        "content": "Generate an image of a male basketball player shooting in a gym. The player should be wearing a white jersey and black shorts and looking at the basket. The background should be a gym with a basketball hoop. The result should be a 1024x768 image."
    },
    "01002": {
        "complexity": 1,
        "source": [
            "image"
        ],
        "target": [
            "image"
        ],
        "content": "You are given a photo of a bedroom `bedroom.jpg`, upscale it by 4x. The result should be a large image with high quality."
    },
    "01003": {
        "complexity": 1,
        "source": [
            "video"
        ],
        "target": [
            "video"
        ],
        "content": "You are given a video `pour_water.mp4` with 24 frames per second. Interpolate the frames to 48 frames per second. The result should be a smoother video with the same duration in gif format."
    },
    "01004": {
        "complexity": 1,
        "source": [
            "image",
            "text"
        ],
        "target": [
            "image"
        ],
        "content": "You are given an image of a red apple in `red_apple.jpg`. Change it into a green one which is put on the table. The result image should be saved as `green_apple.jpg` with the same size."
    },
    "01005": {
        "complexity": 1,
        "source": [
            "image",
            "text"
        ],
        "target": [
            "image"
        ],
        "content": "You are given an image of a sample logo in `sample_logo.png`. Convert it to a cubist art poster with dark colors. Avoid watermark in the result image."
    },
    "01006": {
        "complexity": 1,
        "source": [
            "image",
            "text"
        ],
        "target": [
            "image"
        ],
        "content": "You are given an image of a girl playing guitar in `play_guitar.jpg`. Generate an image of an old man playing guitar in the forest with the same pose as the girl. The result should be a realistic and detailed image with 1024x768 resolution."
    },
    "01007": {
        "complexity": 1,
        "source": [
            "text"
        ],
        "target": [
            "video"
        ],
        "content": "Generate an animation of a robot walking in a forest. The result should be a 2-second video in gif format with 512x512 resolution and 8 frames per second."
    },
    "01008": {
        "complexity": 1,
        "source": [
            "image"
        ],
        "target": [
            "video"
        ],
        "content": "You are given a photo `people_sea.png`. Generate a video based on it. The result should be a 3-second video in gif format with 512x384 resolution and 8 frames per second."
    },
    "01009": {
        "complexity": 1,
        "source": [
            "image",
            "text"
        ],
        "target": [
            "image"
        ],
        "content": "You are given an image `sample_logo.png`. Follow its style to create an app logo of a colorful cat. The result should be a 512x512 image."
    },
    "01010": {
        "complexity": 1,
        "source": [
            "image"
        ],
        "target": [
            "image"
        ],
        "content": "You are given a photo of a bedroom `bedroom.jpg`. Extend it by 128 pixels on both left and right sides. The result should be a larger image with the same height."
    },
    "01011": {
        "complexity": 1,
        "source": [
            "image",
            "image"
        ],
        "target": [
            "image"
        ],
        "content": "You are given a photo of a model `model_stand.jpg`. Replace the face of the model with the face in `woman_portrait.jpg`. The result should be a realistic image with high quality."
    },
    "02001": {
        "complexity": 2,
        "source": [
            "image"
        ],
        "target": [
            "image"
        ],
        "content": "You are given a photo of a bedroom `bedroom.jpg`, extend it by 128 pixels on both left and right sides, and then upscale it by 4x. The result should be a high-quality image."
    },
    "02002": {
        "complexity": 2,
        "source": [
            "image",
            "text"
        ],
        "target": [
            "image"
        ],
        "content": "You are provided with a reference image of a dancing girl `girl_dance.jpg`. Generate an image of a man dancing on the grassland with the same pose as the reference image. The result should be a 1024x768 image, with the man on the left half of the image, while the grassland fills the whole image."
    },
    "02003": {
        "complexity": 2,
        "source": [
            "text"
        ],
        "target": [
            "video"
        ],
        "content": "First generate a video of a cat jumping onto a table. The video should be 2 seconds long with 512x512 resolution and 8 frames per second. Then interpolate the video to 24 frames per second. The result should be a high-quality video saved in gif format."
    },
    "02004": {
        "complexity": 2,
        "source": [
            "image",
            "text"
        ],
        "target": [
            "image"
        ],
        "content": "You are given an image of a sample logo in `sample_logo.png`. First convert it to a cubist art poster with dark colors. Then upscale it by 2x. The result should be a high-quality image."
    },
    "02005": {
        "complexity": 2,
        "source": [
            "text"
        ],
        "target": [
            "video"
        ],
        "content": "First generate an image of a girl drinking coffee. Then turn it into a 2-second video with 512x512 resolution and 8 frames per second. The result should be a video saved in gif format."
    },
    "02006": {
        "complexity": 2,
        "source": [
            "image",
            "text"
        ],
        "target": [
            "image"
        ],
        "content": "You are given a photo of a bedroom `bedroom.jpg`. First follow its style to create a living room image. Then extend it by 128 pixels on both left and right sides. The result should be a high-quality image."
    },
    "03001": {
        "complexity": 3,
        "source": [
            "image",
            "text"
        ],
        "target": [
            "video"
        ],
        "content": "You are given a photo of Budapest `budapest.jpg`. First turn it into a 2-second video with 512x512 resolution and 8 frames per second. Then increase its resolution to 1024x1024 and frame rate to 24 by upscaling and interpolation. The result should be a high-quality video saved in gif format."
    },
    "03002": {
        "complexity": 3,
        "source": [
            "text"
        ],
        "target": [
            "image"
        ],
        "content": "First generate an image of a wooden table with a cup of coffee on it. Then extend it by 128 pixels on both left and right sides. Finally upscale it by 2x. The result should be an image with high resolution and quality."
    },
    "04001": {
        "complexity": 4,
        "source": [
            "image",
            "text"
        ],
        "target": [
            "video"
        ],
        "content": "You are given a photo of Budapest `budapest.jpg`. First generate an image of London with the same style as the given image. Then turn it into a 2-second video with 512x512 resolution and 8 frames per second. Finally increase its resolution to 1024x1024 and frame rate to 24 by upscaling and interpolation. The result should be a high-quality video saved in gif format."
    }
}